package school.helper.thread;

import school.helper.crepper.WebContentManager;
import school.helper.storage.MySqlOperator;

public class ChoosenCourseThread {
    private Thread t;
    public ChoosenCourseThread(WebContentManager wcm, String usertoken) {
        Thread t = new Thread(new Runnable() {
            @Override
            public void run() {
//                String choosen = "{\"已选课程\":[{\"课程类别\":\"必修环节\",\"课程名称\":\"科技报告写作技巧与科技检索\",\"课程老师\":\"张万里\",\"课程学分\":\"1\",\"课程得分\":\"教学评估未完成\"},{\"课程类别\":\"必修环节\",\"课程名称\":\"科技论文写作规范和技巧\",\"课程老师\":\"肖飞\",\"课程学分\":\"1\",\"课程得分\":\"教学评估未完成\"},{\"课程类别\":\"必修环节\",\"课程名称\":\"教学实践\",\"课程老师\":\"&nbsp;\",\"课程学分\":\"1\",\"课程得分\":\"通过\"},{\"课程类别\":\"必修环节\",\"课程名称\":\"学术活动（十次）\",\"课程老师\":\"&nbsp;\",\"课程学分\":\"1\",\"课程得分\":\"通过\"},{\"课程类别\":\"必修环节\",\"课程名称\":\"沟通艺术\",\"课程老师\":\"刘裕\",\"课程学分\":\"1\",\"课程得分\":\"通过\"},{\"课程类别\":\"公共基础课\",\"课程名称\":\"中国特色社会主义理论与实践\",\"课程老师\":\"董良\",\"课程学分\":\"2\",\"课程得分\":\"76.4\"},{\"课程类别\":\"公共基础课\",\"课程名称\":\"硕士生英语阅读与翻译\",\"课程老师\":\"英语组\",\"课程学分\":\"2\",\"课程得分\":\"83\"},{\"课程类别\":\"公共基础课\",\"课程名称\":\"硕士生英语听说与写作\",\"课程老师\":\"英语组\",\"课程学分\":\"1\",\"课程得分\":\"85\"},{\"课程类别\":\"公共基础课\",\"课程名称\":\"硕士生英语水平分级考试\",\"课程老师\":\"&nbsp;\",\"课程学分\":\"&nbsp;\",\"课程得分\":\"成绩未录入\"},{\"课程类别\":\"基础课\",\"课程名称\":\"图论及应用\",\"课程老师\":\"杨春\",\"课程学分\":\"3\",\"课程得分\":\"80\"},{\"课程类别\":\"基础课\",\"课程名称\":\"矩阵理论\",\"课程老师\":\"王转德\",\"课程学分\":\"3\",\"课程得分\":\"75.2\"},{\"课程类别\":\"基础课\",\"课程名称\":\"最优化理论与应用\",\"课程老师\":\"张晓伟\",\"课程学分\":\"2.5\",\"课程得分\":\"80.2\"},{\"课程类别\":\"专业基础课\",\"课程名称\":\"高级计算机网络(1)--原理与体系结构\",\"课程老师\":\"毛玉明\",\"课程学分\":\"2\",\"课程得分\":\"81\"},{\"课程类别\":\"专业选修课\",\"课程名称\":\"无线互联网\",\"课程老师\":\"王晟\",\"课程学分\":\"2\",\"课程得分\":\"通过\"},{\"课程类别\":\"专业选修课\",\"课程名称\":\"互联网安全\",\"课程老师\":\"于富财\",\"课程学分\":\"2\",\"课程得分\":\"通过\"},{\"课程类别\":\"专业选修课\",\"课程名称\":\"现代无线与移动通信系统\",\"课程老师\":\"李少谦\",\"课程学分\":\"2\",\"课程得分\":\"不通过\"},{\"课程类别\":\"跨学科选修课\",\"课程名称\":\"Linux操作系统内核技术\",\"课程老师\":\"段翰聪\",\"课程学分\":\"2\",\"课程得分\":\"60\"},{\"课程类别\":\"跨学科选修课\",\"课程名称\":\"Linux环境高级编程\",\"课程老师\":\"李林\",\"课程学分\":\"1\",\"课程得分\":\"通过\"},{\"课程类别\":\"跨学科选修课\",\"课程名称\":\"互联网络程序设计\",\"课程老师\":\"聂晓文\",\"课程学分\":\"1\",\"课程得分\":\"通过\"},{\"课程类别\":\"跨学科选修课\",\"课程名称\":\"大数据分析与挖掘\",\"课程老师\":\"邵俊明\",\"课程学分\":\"1\",\"课程得分\":\"通过\"},{\"课程类别\":\"其它选修课\",\"课程名称\":\"自然辩证法\",\"课程老师\":\"丁科\",\"课程学分\":\"1\",\"课程得分\":\"通过\"}]}\n";
                String choosen = "";
                try {
                    choosen = wcm.getAllCourse();
                } catch (Exception e) {
                    e.printStackTrace();
                }
                System.out.println(choosen);
                new MySqlOperator().updateChoosenCourse(usertoken, choosen);
            }
        });
        t.start();
    }
}
